
#Область ОбработчикиСобытий

//	Описание:
//		Несколько видов возвращаемых значений:
//		- 200 - пустой ответ
//		- 201 - текстовый ответ с заголовком
//		- 202 - ответ со строковым значением
//		- 500 - ответ с json-объектом
//
//	Возвращаемые ответы:
//		200 - Неопределено
//		201 - text/plain - Строка - Некоторое представление ответа
//		Заголовки ответа:
//			* X-Header - Строка - Произвольный заголовок ответа
//		202 - image/jpeg - ДвоичныеДанные
//		500 - application/json - Структура {
//			* error - Строка
//		}
Функция VariantsGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

//	Описание:
//		Несколько возвращаемых ответов для одного кода состояния
//
//	Возвращаемые ответы:
//		200 - 
//			Неопределено
//			image/jpeg - ДвоичныеДанные
//		400 - 
//			application/json - Структура {
//				* error - Строка
//			}
//			application/xml - Структура<имя = "root"> {
//				* error - Строка
//			}
Функция VariantsPOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
