
#Область ОбработчикиСобытий

//	Описание:
//
//      ## Изображение:
//
//      ![](https://1c-swagger.ru/images/logo_big.svg "Логотип sweet")
//
//      ## Список:
//		- _Один_
//		- **Два**
//		- <u>Три</u>
//      
//      ## Таблица:
//		|Столбец 1|Столбец 2|Столбец 3|
//      |-|-|-|
//      |Запись|Запись|Запись|
//
//      ## Чекбоксы:
//      - [x] Отмеченный пункт
//		- [ ] Неотмеченный пункт
//
//	Возвращаемые ответы:
//		200 - Неопределено
Функция VariantsGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
