// Описание объектов:
//   Error - Структура {
//     * message - Строка - Описание ошибки
//   }

// Описание:
//   Возвращает элемент.
// Возвращаемые ответы:
//   200 - json - Строка - Идентификатор элемента
//   404 - json - Объект(Error) - Элемент не найден
Функция GetItem(Запрос)
    Возврат Новый HTTPСервисОтвет(200);
КонецФункции

// Описание:
//   Проверяет доступность сервиса.
// Возвращаемые ответы:
//   200 - text - Строка. Пример: "OK"
Функция Health(Запрос)
    Возврат Новый HTTPСервисОтвет(200);
КонецФункции
